let jokesArray = [
    "कितना रोया था वो अपने गर्लफ्रेंड को मोबाइल गिफ्ट करके…\nजब रात को 3 बजे तक सुनता रहा…\n‘आपके द्वारा डायल किया गया नंबर अभी दूसरी कॉल पर व्यस्त है’",
    "एक दिन पति ने अपनी पत्नी से पूछा, “बताओ, शादी में दूल्हा घोड़ी की जगह गधे पर चढ़कर क्यों नहीं आता?”\nपत्नी ने जवाब दिया, “ताकि दुल्हन एक साथ दो गधो को देखकर बेहोश न हो जाए।",
    "‘शेर’ की तरह जीनेवाले अक्सर शादी के बाद ‘शेरू’ बन जाते है। 😂😜😜",
    "पता नहीं लोग पहली नजर में ही…\nसच्चा प्यार कैसे ढूंढ लेते हैं…\nयहां तो आधे घंटे तक…\nसेलो टेप का किनारा ही नहीं मिल पाता…!!!",
    "घर वाले मुझे सुबह-सुबह ऐसे उठाते हैं \nजैसे तीसरा विश्व युद्ध शुरू हो गया है औ मैं ही आखिरी सैनिक बचा हूं!!",
    "नाई की आंख में भी आंसू आ गए जब उसके एक कस्टमर ने कहा\nबाल इतने छोटे कर दो कि बीबी के हाथ में न आयें…!!",
    "यदि करवाचौथ जैसे व्रत न होते \nतो यकीनन बहुत से पति तो भूल ही जाते कि \nवो पत्नी के साथ रह रहे या मालकिन के साथ। 🙈",
    "बड़ी बहन मां की तरह होती है \nऔर छोटी बहन दादी मां की तरह…",
    "संता ने बंता को थप्पड़ मारा।\nबंता: ये तूने मज़ाक में मारा या सिरियस में।\nसंता: सीरियस में।\nबंता: फिर ठीक है, मज़ाक मुझे बिल्कुल पसंद नही।",
    "आदमी अपने घर में सिर्फ दो ही कारणों से खुश रहता है\nजब बीवी ‘नई हो’ या फिर ‘बीवी नहीं’ हो।",
    "टीचर,स्टूडेंट से: तुमने मेरा दिमाग खराब कर दिया, कल तुम्हारे पापा से मिलूंगा\nस्टूडेंट: सप पापा से नहीं चाचा से मिलिए, डॉक्टर तो वो हैं!!!",
    "टीचर ने एक गधे के सामने एक बाल्टी पानी और एक बोतल शराब रखी…गधा सारा पानी पी गया\nटीचर ने बच्चों से पूछा तो तुमने क्या सीखा ?\nबच्चे: जो शराब नहीं पीता वो गधा है…!!",
    "पिता: अगर तू फिर परीक्षा में फेल हुआ तो मुझे पापा मत बोलना।\nरिजल्ट के बाद…\nपिता: तुम्हारा रिजल्ट कैसा रहा.?\nपुत्र: दिमाग खराब मत कर मदनलाल, तूने बाप होने का हक खो दिया है!!!",
];

// let index = Math.floor(Math.random() * jokesArray.length - 1);
// console.log(jokesArray[index]);

console.log("length of array is :", jokesArray.length);

// let random = Math.floor(Math.random() * jokesArray.length - 1);
// console.log("current index is : ", random)

let jokeArea = document.getElementById('jokearea');
let btn = document.getElementById('btn');

let emoji = document.getElementById("first");
let html = "<p> 😂😂 </p>";


btn.addEventListener('click', function () {
    let index = Math.floor(Math.random() * jokesArray.length - 1);
    console.log(index);
    if (index < 0)
        jokeArea.innerText = jokesArray[0];
    console.log("New joke : ", jokesArray[index]);
    jokeArea.innerText = jokesArray[index];
})

emoji.insertAdjacentHTML("beforeend", html);